----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 288, 384]             224
              ReLU-2          [-1, 8, 288, 384]               0
       BatchNorm2d-3          [-1, 8, 288, 384]              16
            Conv2d-4          [-1, 8, 288, 384]             584
              ReLU-5          [-1, 8, 288, 384]               0
       BatchNorm2d-6          [-1, 8, 288, 384]              16
         MaxPool2d-7          [-1, 8, 144, 192]               0
         DownBlock-8  [[-1, 8, 144, 192], [-1, 8, 288, 384]]               0
            Conv2d-9         [-1, 16, 144, 192]           1,168
             ReLU-10         [-1, 16, 144, 192]               0
      BatchNorm2d-11         [-1, 16, 144, 192]              32
           Conv2d-12         [-1, 16, 144, 192]           2,320
             ReLU-13         [-1, 16, 144, 192]               0
      BatchNorm2d-14         [-1, 16, 144, 192]              32
        MaxPool2d-15           [-1, 16, 72, 96]               0
        DownBlock-16  [[-1, 16, 72, 96], [-1, 16, 144, 192]]               0
           Conv2d-17           [-1, 32, 72, 96]           4,640
             ReLU-18           [-1, 32, 72, 96]               0
      BatchNorm2d-19           [-1, 32, 72, 96]              64
           Conv2d-20           [-1, 32, 72, 96]           9,248
             ReLU-21           [-1, 32, 72, 96]               0
      BatchNorm2d-22           [-1, 32, 72, 96]              64
        MaxPool2d-23           [-1, 32, 36, 48]               0
        DownBlock-24  [[-1, 32, 36, 48], [-1, 32, 72, 96]]               0
           Conv2d-25           [-1, 64, 36, 48]          18,496
             ReLU-26           [-1, 64, 36, 48]               0
      BatchNorm2d-27           [-1, 64, 36, 48]             128
           Conv2d-28           [-1, 64, 36, 48]          36,928
             ReLU-29           [-1, 64, 36, 48]               0
      BatchNorm2d-30           [-1, 64, 36, 48]             128
        DownBlock-31  [[-1, 64, 36, 48], [-1, 64, 36, 48]]               0
  ConvTranspose2d-32           [-1, 32, 72, 96]           8,224
             ReLU-33           [-1, 32, 72, 96]               0
      BatchNorm2d-34           [-1, 32, 72, 96]              64
      Concatenate-35           [-1, 64, 72, 96]               0
           Conv2d-36           [-1, 32, 72, 96]          18,464
             ReLU-37           [-1, 32, 72, 96]               0
      BatchNorm2d-38           [-1, 32, 72, 96]              64
           Conv2d-39           [-1, 32, 72, 96]           9,248
             ReLU-40           [-1, 32, 72, 96]               0
      BatchNorm2d-41           [-1, 32, 72, 96]              64
          UpBlock-42           [-1, 32, 72, 96]               0
  ConvTranspose2d-43         [-1, 16, 144, 192]           2,064
             ReLU-44         [-1, 16, 144, 192]               0
      BatchNorm2d-45         [-1, 16, 144, 192]              32
      Concatenate-46         [-1, 32, 144, 192]               0
           Conv2d-47         [-1, 16, 144, 192]           4,624
             ReLU-48         [-1, 16, 144, 192]               0
      BatchNorm2d-49         [-1, 16, 144, 192]              32
           Conv2d-50         [-1, 16, 144, 192]           2,320
             ReLU-51         [-1, 16, 144, 192]               0
      BatchNorm2d-52         [-1, 16, 144, 192]              32
          UpBlock-53         [-1, 16, 144, 192]               0
  ConvTranspose2d-54          [-1, 8, 288, 384]             520
             ReLU-55          [-1, 8, 288, 384]               0
      BatchNorm2d-56          [-1, 8, 288, 384]              16
      Concatenate-57         [-1, 16, 288, 384]               0
           Conv2d-58          [-1, 8, 288, 384]           1,160
             ReLU-59          [-1, 8, 288, 384]               0
      BatchNorm2d-60          [-1, 8, 288, 384]              16
           Conv2d-61          [-1, 8, 288, 384]             584
             ReLU-62          [-1, 8, 288, 384]               0
      BatchNorm2d-63          [-1, 8, 288, 384]              16
          UpBlock-64          [-1, 8, 288, 384]               0
           Conv2d-65          [-1, 1, 288, 384]               9
================================================================
Total params: 121,641
Trainable params: 121,641
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.27
Forward/backward pass size (MB): 2052642.52
Params size (MB): 0.46
Estimated Total Size (MB): 2052644.25
----------------------------------------------------------------
